from pprint import pprint
import os
import json

def write_json(dict, dir = os.getcwd(), json_name = 'result.json'):
    with open(f'{dir}/{json_name}', 'w', encoding='utf-8') as f:
        json.dump(dict, f, indent=4, sort_keys=True, ensure_ascii=False)


courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python", "Frontend-разработчик с нуля"]

mentors = [
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]

# делаем список списков имен
def supernames(courses, mentors):
    res = list()
    mentors_names = []
    for m in mentors:
        mentors_names.append(list(set([x.split(" ")[0].strip() for x in m])))

    for i in range(3):
        for j in range(i+1,4):
            res.append(f"На курсах '{courses[i]}' и '{courses[j]}' преподают: {', '.join(sorted(list(set(mentors_names[i]).intersection(set(mentors_names[j])))))}")
    return res

if __name__ == '__main__':
    print(type(supernames(courses, mentors)))

